name = input("enter yout name here:" )
surname = input("enter your name here:" )
print(name)
print(surname)
#ინფუთ ფუნქციის მერე ფრცხილებში რამეს რომ ჩავწერტ ტერმინალში გვერდით რასაც მუვუწერთ იმას გამოიტანს მერე პრინტ ფუნქციით


point = 50
point = 75
point = 100
print(point)
#ეხლა ტერმინალში გამოიტანს 100 იმიტომ,რომ პითონში ტერმინალში დაიწერება ის რაც პრინტემადე დაწერეს ბოლოს და ამას განახლება ეწოდება



age1 = 156
print(age1)
#თავიდან იყო 1age == 156 print ( ("1age) და ეს შეცდომაა იმიტომ,რომ ცვლადის სახელში ჯერ იწერება სიტყვა და მერე ციფრი,ეწერაორი ტოლობა,ერთი ფრცხილი და ბრჭყალი იყო ზედმეტი

num1 = "a"
num2 = "b"
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)
#პირველი ტოლია ab რადგან დამატებიტ ისინე გბერდი გვერდ შეერტდა და დანარჩენი არ შესრულდება და ერორია


#არასწორი კოდი 1game =+-/ roblox print(roblox"
game1 = "roblox"
print(game1)  #სწორი ვერსია