# 1) ფუნქცია, რომელსაც პარამეტრად გადაეცემა age
def check_age(age):
    if age > 18:
        print("შენ ხარ სრულწლოვანი")
    else:
        print("შენ არხარ სრულწლოვანი")


# 2) if-else statement-ის ახსნა (კომენტარით)
# if-else რომელიც გამოიყენება გადაწყვეტილებების მისაღებად.
# if ნაწილში იწერება პირობა, თუ ეს პირობა True იქნება, შესრულდება if-ის ბლოკი,
# ხოლო თუ False იქნება, მაშინ შესრულდება else-ის ბლოკი.


# 3) while loop-ის ახსნა (კომენტარით)
# while loop გამოიყენება მაშინ, როცა გვინდა გარკვეული კოდი განმეორდეს მანამ,
# სანამ მოცემული პირობა True-ა. როდესაც პირობა გახდება False, ციკლი შეწყდება.


# 4) while loop-ის გამოყენებით რიცხვები 100-დან 0-მდე
num = 100
while num >= 0:
    print(num)
    num -= 1


# 5) მომხმარებლის ასაკის შემოტანა და ფასდაკლების გამოთვლა
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age >= 18:
    print("თქვენ გადაიხდით რეგულარული ფასებით")
else:
    print("თქვენ მიიღეთ 20% ფასდაკლება")